* Org
Promote text -> heading, demote heading -> text
#+begin_src elisp
org-toogle-heading ;; C-c *
#+end_src
** Org Babel code block edit code :org:babel:code:
#+begin_src elisp
org-edit-src-code
#+end_src
** Org Babel execute code block :org:babel:code:
#+begin_quote
C-c C-c
#+end_quote
* Capture
C-c c - enter capture mode
C-c w - refile the entry to different file
C-c C-c - finilize the capture
C-c C-k - org capture kill
If in agenda: k c insert under the cursor date in the agenda

C-u C-c c Visit the target location of a capture template. You get to select the template in the usual way.

C-u C-u C-c c Visit the last stored capture item in its buffer.
* Spreadsheet
$<num> - col
@<num> - row

C-c ? - get the info/address on the cell
C-c } - visualize table structure
C-c C-c - refresh/evaluate the sheet

| Student  | Maths | Physics | Mean |
|----------+-------+---------+------|
| Bertrand |    13 |      09 |      |
| Henri    |    15 |      14 |      |
| Arnold   |    17 |      13 |      |

** Formula
:= - is cell formula
=  - is row formula

Example:
  =vmean($2..$3)

| Student  | Maths | Physics | Mean |
|----------+-------+---------+------|
| Bertrand |    13 |      09 |   11 |
| Henri    |    15 |      14 | 14.5 |
| Arnold   |    17 |      13 |   15 |
#+tblfm: $4=vmean($2..$3)

To update the whole table - update the TBLFM.

*** Edit formula

In a minibuffer

At the cell - C-c =

In a dedicated buffer

At the cell C-c '

*** Calc formula

=2+3*4*5/6*7^8-9
| =2+3*4*5/6*7^8-9 |
|       -6.9999983 |

*** Elisp formula

Add it in the form
$5='(substring (number-to-string $pi) (round $4) (1+ (round $4)));N
If the mean of a student is 10, this formula returns the tenth decimal of Pi.
#+constants: pi=3.14159265358979323846
| Student  | Maths | Physics | Mean | Pi |
|----------+-------+---------+------+----|
| Bertrand |    13 |      09 |   11 |  5 |
| Henri    |    15 |      14 | 14.5 |  7 |
| Arnold   |    17 |      13 |   15 |  9 |
#+tblfm: $4=vmean($2..$3)::$5='(substring (number-to-string $pi) (round $4) (1+ (round $4)));N

, where:
    (substring S A B): get a substring of string S between A and B
    (number-to-string $pi): convert the constant "Pi" into a string
    (round $4): get the rounded value of the value in column $4
    ;N: consider the values of fields to be numeric values, not strings.

*** Formula debugging

#+constants: pi=3.14159265358979323846

| Student  | Maths | Physics | Mean | Pi |
|----------+-------+---------+------+----|
| Bertrand |    13 |      09 |   11 |  5 |
| Henri    |    15 |      14 | 14.5 |  7 |
| Arnold   |    17 |      13 |   15 |  9 |
#+tblfm: $4=vmean($2..$3)::$5='(substring (number-to-string $pi) (round $4) (1+ (round $4)));N

If you come back to this table but feel a bit lazy trying to understand what the Emacs Lisp function does,
you might as well want to debug the formula and follow the computation step by step.

C-c { - formula debugger

Then refresh TBLFM.
* Table
** Basic table creation
| To create a table place pipe at the biginning of text           |
| When you press TAB inside cell - the next cell would be created |

*** Create the structure of table, use `C-c |`:
|   |   |   |   |
|---+---+---+---|
|   |   |   |   |
|   |   |   |   |

To jump through cells use TAB and S-TAB. Or RET.
RET going to create columns on rows.

*** Converting a region into a table
Usually, `C-c |` smart enough to guess field separator (TAB or comma).

some, comma, separated, values

| some | comma | separated | values |

** Editing table structure
*** Moving rows/colums
Move them aroung with M-<arrow keys>

| A | B | C |
|---+---+---|
| a | b | c |
| 1 | 2 | 3 |

*** Inserting rows/columns
(Shift-Alt-<arrow keys)
S-M-<arrow keys>

| A | B | C |
|---+---+---|
| a | b | c |
| 1 | 2 | 3 |

*** Narrowing the visible part of a column

C-c TAB - narrowing/widening
| <10>             | <15>                        |
| A very wide cell | Another very very wide cell |

To edit cell in searate window - C-c `

*** Preparing tables for export
**** Grouping columns
You can group column like this:

|   |  N | N^2 | N^3 | N^4 | sqrt(n) | sqrt[4](N) |
|---+----+----+----+----+---------+------------|
| / | <> |  < |    |  > |       < |          > |
| # |  1 |  1 |  1 |  1 |       1 |          1 |
| # |  2 |  4 |  8 | 16 |  1.4142 |     1.1892 |
| # |  3 |  9 | 27 | 81 |         |     1.3161 |
|---+----+----+----+----+---------+------------|
** Name tables
#+CAPTION: This is the caption for the next table (or link)
#+NAME:   tab:basic-data
| ... | ... |
|-----+-----|
|     |     |

Refer to the object with [[tab:basic-data]]

* Automatically show LaTeX formulas/expressions
#+begin_src org
#+startup: latexpreview
#+end_src

* Browse symbol dictionary of all special symbols available
#+begin_src elisp
(org-entities-help)
#+end_src
* Org insert templates
#+begin_example
SPC i b
#+end_example
* Heading, section alias link
For same heading use several CUSTOM-IDs.
#+begin_src text
:CUSTOM_ID: cust-id
And then [[#cust-id][link]]
#+end_src
* Agenda
** Agenda keys
| Name             | Key   | Description                                                |
|------------------+-------+------------------------------------------------------------|
| Follow mode      | F     | The buffer splits in half and shows the sources of entries |
| Log mode         | L     | Show done and clocked tasks.                               |
| Time grid        | g d   | Open/close time grid.                                      |
| Mark             | m     | Mark for bulk action.                                      |
| Umark            | u     | Umark for bulk action.                                     |
| Moon             | M     | Show phases of the Moon.                                   |
| Sun              | S     | Show phases of the Sun.                                    |
| SHDT             | , d s | Shedule.                                                   |
| DUET             | , d d | Deadline.                                                  |
| Show entry       | E     | Display body text.                                         |
| Clock table      | R     | Toggle clock table display.                                |
| Show tags        | T     | Show tags of the entry.                                    |
| Goto             | TAB   | Open a entry in other buffer.                              |
| Add note         | z     | Into the entry.                                            |
| Holidays         | H     |                                                            |
| Switch to        | RET   | Open in current buffer.                                    |
| Priority up      | +     |                                                            |
| Priority down    | -     |                                                            |
| Toggle diary     | D     |                                                            |
| Diary entry      | i     |                                                            |
| Date prompt      | >     |                                                            |
| Filter by tag    | \     |                                                            |
| Filter by effort | _     |                                                            |
| Filter by regexp | =     |                                                            |
| Clock report     | R     |                                                            |

